# RbsGbxmlSurfaceType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsGbxmlSurfaceType Property
ParameterTypeId Class See Also
---
"Surface Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsGbxmlSurfaceType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsGbxmlSurfaceType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsGbxmlSurfaceType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace